// დავალება 4.1
// შექმენით მასივი ნებისმიერი ტიპის და რაოდენობის ელემენტებით. ეკრანზე გამოიტანეთ ამ მასივის სიგრძე.

function f41(){
    let arr = [1, 2, 3, "ოთხი", "ხუთი"];
    alert(arr.length);
}


// _________________________________________________________________


// დავალება 4.2
// მოცემულია მასივი arr. ინდექსის გამოყენებით მასივს დაამატეთ ახალი ელემენტი 'd', ხოლო რიგით მეორე
// ელემენტი ჩაანაცვლეთ 'x'-ით.

function f42(){
    let arr = ['a', 'b', 'c'];
    arr[3] = 'd';
    arr[2] = 'x';
    alert(arr);
}


// _________________________________________________________________


// დავალება 4.3
// მოცემულია ცარიელი მასივი arr. მეთოდი .push-ის გამოყენებით მასივს დაამატეთ ახალი ელემენტები 'a', 'b'
// და 'c'.

function f43(){
    let arr = [];
    arr.push('a', 'b', 'c');
    alert("V1 arr = " + arr);

    arr.push(1,2);
    alert("V2 arr = " + arr);
    alert(typeof arr);
}


// _________________________________________________________________


// დავალება 4.4
// მოცემულია მასივი arr და ცვლადები key1, key2.
// key1-ის ინდექსის მქონე მასივის ელემენტს მიუმატეთ key2 ინდექსის მასივის ელემნტი და შედეგი კონსოლზე გამოიტანეთ.

function f44(){
    let arr = [1, 2, 3, 4, 5], key1 = 1, key2 = 2;
    alert("V1 = " + parseInt(arr[key1] + arr[key2]));

    arr.push(6,7,8);
    arr.unshift(-1,0);
    alert("V2 = " + arr);
}


// _________________________________________________________________


// დავალება 4.5
// მოცემულია მასივი arr. ოპერატორი delete-ით წაშალეთ მასივის რიგით მე-2 და მე-4 ელემენტები. კონსოლზე
// გამოიტანეთ ჯერ მასივის სიგრძე და მერე თვით ეს მასივიც. შეიცვალა თუ არა მასივის სიგრძე?

function f45(){
    let arr = ['a', 'b', 'c', 'd', 'e'];
    delete arr[2];
    delete arr[4];
    alert(arr);
}


// _________________________________________________________________


// დავალება 4.6
// მოცემულია კოდი, რომელმაც კონსოლზე უნდა გამოიტანოს მასივის ბოლო ელემნტი. აღმოაჩინეთ შეცდომა
// კოდში.

function f46(){
    let arr = [11, 22, 33, 44, 55];
    alert(arr[arr.length - 1]);
}


// _________________________________________________________________


// დავალება 4.7
// მოცემულია კოდი, რომელმაც კონსოლზე უნდა გამოიტანოს მასივის სიგრძე. აღმოაჩინეთ შეცდომა კოდში

function f47(){
    let arr = [10, 11, 12, 13, 14];
    alert(arr.length);
}


// _________________________________________________________________


// დავალება 4.8
// მოცემულია კოდი, რომელმაც კონსოლზე უნდა გამოიტანოს მასივის სიგრძე. აღმოაჩინეთ შეცდომა კოდში.

function f48(){
    let arr = [10, 11, 12, 13, 14];
    alert(arr.length);
}

// _________________________________________________________________


function Visible(){
    document.getElementById("test").style.visibility = "Visible";
}
