import os
import davaleba_1
import davaleba_2
import time

def Cls():
    os.system("cls")

Cls()

print("""
{1}-დავალება 1
    დაწერეთ პროგრამა, რომელიც მომხმარებელს კითხავს, თუ როდის არის მისი დაბადების დღე. ინფორმაციის მიღების შემდეგ კი დაბეჭდავს მისი დაბადების დღემდე დარჩენილი დღეების რაოდენობას.

{2}-დავალება 2
    დაწერეთ თამაში, რომელიც მოხმარებელს ეტყვის, დააჭიროს “enter”-ს n წამის შემდეგ. n - აიღეთ შემთხვევითი რიცხვი 2-დან 7-მდე. იმ შემთხვევაში, თუ დააგვიანა, პროგრამამ უნდა დაწეროს თუ რამდენი ხნით დააგვიანა მომხმარებელმა, ხოლო, თუ ადრე დააჭირა, რამდენი ხნით მეტი უნდა მოეცადა. (გამოიყენეთ random და time ბიბლიოთეკები)
""")

x = input(">>>>")
match x:
    case '1':
        davaleba_1.f_davaleba_1()
    case '2':
        davaleba_2.f_davaleba_2()
