var x = prompt("აირჩიეთ ვარიანტი:\n 1.1) გამოაცხადეთ ცვლადი counter. განახორციელეთ მისი ინკრემენტირება (მნიშვნელობის გაზრდა 1-ით) და შემდეგ alert-ით გამოიტანეთ ეკარანზე.\n\n 1.2) გამოაცხადეთ ცვლადი num, მიანიჭეთ მას მნიშვნელობა 5 და alert-ით გამოიტანეთ ეკარანზე, შემდეგ მიანიჭეთ ახალი მნიშვნელიბა 10 და გამოიტანეთ ეკარანზე.\n\n  1.3) გამოაცხადეთ ცვლადი b, მიანიჭეთ მას 10, 20 და 30-ის ჯამი, alert-ით გამოიტანეთ ეკარანზე. \n\n 1.4)გამოაცხადეთ ცვლადი a მნიშვნელობით 100, ცვლადი b მნიშვნელობით 40, a-ს გამოაკელით b და შედეგი)მიანიჭეთ c-ს. გამოაცხადეთ ცვლადი d, მიანიჭეთ მას 20. აჯამეთ c და d-ს მნიშვნელობები და შედეგი მიანიჭეთ ცვლადს result-ში. result-ის მნიშვნელობა გამოიტანეთ ეკრანზე. \n\n 1.5) კოდის გაშვების გარეშე განსაზღვრეთ რა გამოვა ეკრანზე: let a = (2 + 3) * 2 + 3; alert(a); \n\n 1.6)გამოაცხადეთ ცვლადი c და მიანიჭეთ მას წარმოდგენილი ცვლადების განაყოფის ნაშთი, შედეგი ეკრანზე გამოიტანეთ. let a = 13; let b = 5; \n\n  1.7) კოდის გაშვების გარეშე განსაზღვრეთ რა გამოვა ეკრანზე: let a = 3 * 2 ** 3 * 3; alert(a); \n\n  1.8) გამოაცხადეთ ცვლადი თქვენი დაბადების დღის აღსანიშნავად (მაგ: '12.07.2005'), სწორად შეარჩიეთ ცვლადის სახელი იმის გათვალისწინებით იცვლება თუ არა დაბადების დღე. ცვლადის მნიშვნელობა გამოიტანეთ კონსოლზე.");

switch(parseInt(x)){
    case 1:{
        var count = 1;
        count++;
        alert("count = " + count);
    }break;

    case 2:{
        var num = 5;
        alert("num = " + num);
        num = 10;
        alert("new num = " + num);
    }break;

    case 3:{
        var b = 10 + 20 + 30;
        alert("10 + 20 + 30 = " + b);
    }break;

    case 4:{
        var a = 100;
        var b = 40;
        var c = a - b;
        var d = 20;
        result = c + d;
        alert("result = " + result);
    }break;

    case 5:{
        let a = (2 + 3) * 2 + 3;
        alert(a);
    }break;

    case 6:{
        let a = 13;
        let b = 5;
        let c = 13 % 5;
        alert("c = " + c);
    }break;

    case 7:{
        let a = 3 * 2 ** 3 * 3;
    alert(a);
    }break;

    case 8:{
        const Mydate = "04.12.1996";
        alert(Mydate);
    }break;

    default:alert("თქვენი ჩაწერილი ვარიანტი არ არსებობს");
}