import os
import pirveliAmocana
import meoreAmocana
os.system("cls")
print("აირჩიეთ ვარიანტი:")
print("""
1.	დაწერეთ ფუნქცია, რომელსაც ექნება ერთი არგუმენტი - string ტიპის მონაცემი. ფუნქციამ უნდა დააბრუნოს dictionary, რომელშიც გასაღებები იქნება შემავალ string-ში არსებული სიმბოლოები, ხოლო მნიშვნელობები - ამ სიმბოლოების რაოდენობა. მაგალითად, თუ ფუნქციას გადავცემთ „Hello world”. მან უნდა დაგვიბრუნოს შემდეგი:
{
   ‘H’ : 1,
   ‘e’ : 1,
   ‘l’ : 3,
   ‘o’ : 2,
   ‘ ‘ : 1,
   ‘w’: 1,
   ‘r’ : 1,
   ‘d’ : 1
}

2.	დაწერეთ პროგრამა „რეცეპტები“, რომელიც მომხმარებელს საშუალებას მისცემს, დაათვალიეროს, შეინახოს და მოძებნოს სხვადასხვა კერძების რეცეპტები. 

პროგრამას უნდა ჰქონდეს მთავარი მენიუ, რომელიც მომხმარებელს საშუალებას მისცემს, აირჩიოს სასურველი მოქმედება.
•	მოქმედება 1: დაამატოს კერძის სახელი და ინგრედიენტები. 
•	მოქმედება 2: ნახოს ყველა კერძი და შესაბამისი ინგრედიენტები.
•	მოქმედება 3: მოძებნოს კერძები ინგრედიენტის მიხედვით. (შეიყვანოს ინგრედიენტი და პროგრამამ დაუწეროს კერძები, რომლებსაც გააჩნიათ შეყვანილი ინგრედიენტი)
•	მოქმედება 4: პროგრამიდან გამოსვლა.
მითითებები: 
გამოიყენეთ „dictionary” კერძების და ინგრედიენტების შესანახად;
გამოიყენეთ ფუნქციები და განმარტეთ ისინი ცალკე ფაილში (მოდულში)

""")
x = input(">>>> ")
match x:
    case "1":
        pirveliAmocana.main()
    case "2":
        meoreAmocana.main()
