# 1)    შექმენით string ტიპის ცვლადი სახელად „name”. მიანიჭეთ მას თქვენი სახელი. დაბეჭდეთ ტექსტი: “Hello, [name]” სადაც name იქნება შექმნილი ცვლადის მნიშვნელობა. 
# name = "beqa"
# print("hello",name)


# 2)     მომხმარებელს მოთხოვეთ ასაკის შეყვანა, გამოთვალეთ, თუ რამდენი წლის იქნება ის 5 წლის შემდეგ და დაბეჭდეთ შედეგი.
# print("ჩაწერეთ თქვენი ასაკი")
# x = int(input())
# print("ხუთი წლის შემდეგ თქვენ იქნებით ",x + 5)



# 3)     Python-ის გამოყენებით გამოთვალეთ: რას უდრის ((5+2.3)**2-2)/3 ? რას უდრის გაყოფის შედეგად მიღებული ნაშთი?
# result = ((5+2.3)**2-2)
# print(result % 3)

# 4.	მომხმარებელს მოთხოვეთ რიცხვის შეყვანა. გამოთვალეთ რიცხვის კვადრატი, კუბი და მე-4 ხარისხი. დაბეჭდეთ შედეგები.
# print("ჩაწერეთ რიცხვი >>>>") 
# num =  int(input())
# print("რიცხვის კვადრატი = ", num*num)
# print("რიცხვის კუბი = ", num**num)
# print("რიცხვის მეოთხე ხარისხი = ", num**num*num)